{"title":"Gold soars past Rs300,000 per tola","tag":"Money","content":"Gold prices continued their relentless climb, crossing Rs300,000 per tola in the domestic bullion market for the first time, buoyed by global tensions and mounting economic uncertainty.\nOn Friday, the last trading day of the week, gold jumped by Rs9,200 per tola to Rs301,400 per tola, according to the Federation of Gold and Silver Dealers’ Association. Over the past year, the price of the precious metal has surged by Rs141,400 a tola.\nIn the international market, spot gold traded at $4,957.1 per ounce on Friday after scaling a record high of $4,966.59 earlier in the day.\nInternational bullion analysts say the rally is being driven by persistent economic and geopolitical risks. “As we do not expect these risks to fade in the near term, we believe gold still has further upside potential,” Adarsh Diwe, a Mumbai-based consultant at Metals Focus who tracks South Asian bullion markets, told the Post.\nHe said the lingering uncertainty around US policy, sustained geopolitical tensions, and growing concerns over sovereign debt in major industrialised economies are reinforcing gold’s role as a diversification asset.\nGold is widely viewed as a hedge against currency market volatility. Traditionally, it moves in the opposite direction of the US dollar, as weakness in the dollar makes dollar-priced gold cheaper for holders of other currencies, and vice-versa. Recent trade tariffs imposed by US President Donald Trump have triggered a global trade war, rattling currency markets worldwide.\nThe policy stance of global central banks has also played a key role in shaping gold’s trajectory. Lower interest rates reduce the opportunity cost of holding gold, which does not yield interest, making it more attractive to investors.\nLarge buyers and institutional investors typically source gold from major banks, while prices in the spot market are determined by real-time supply and demand. Spot gold refers to the current market price at which the metal can be bought or sold for immediate delivery.\n“Based on the current trend, the price of gold and silver is expected to continue rising. At this point, we have no idea where the bullion price will break and how much further it will go,” said Arjun Rasaili, president of the federation.\nHe added that unless the US changes its foreign policy stance, gold prices are likely to stay on an upward trajectory. Domestic bullion traders say gold could soon reach Rs325,000 per tola.\nDespite record-breaking prices, demand remains strong. Traders say consumers continue to buy gold in anticipation of further gains. The ongoing wedding season has also provided a modest boost to demand, Rasaili said.\nAt the same time, the trend of people selling their old gold jewellery has declined, increasing the need for imported gold. “There would be no demand for imported gold if buyers sold their gold,” Rasaili said.\nReflecting rising demand, gold imports jumped by 137.52 percent in the second quarter of the current fiscal year compared to the same period last year. According to the Department of Customs, Nepal imported 1,104 kilograms of gold worth Rs19.67 billion in the first six months of the current fiscal year until mid-January, up from 726 kilograms in the same period last year.\nIn response, Nepal Rastra Bank, the central bank, increased the daily gold import quota to 25 kg, from 20 kg in October.\n“Demand has also been fuelled by people investing in gold as prices break records almost daily,” Rasaili said, adding that the domestic bullion market currently sells 15 to 20 kg of gold each day. Traders say many people are withdrawing savings to invest in gold and silver.\nMuch of the demand is for coins and pure wire rings, locally known asberuwa aunthi, which are favoured for their assured resale value.","url":"https://kathmandupost.com/money/2026/01/24/gold-soars-past-rs300-000-per-tola","scraped_at":"2026-01-24T18:57:03.224387"}